import json
import random

import torch
from data import *
from torch.utils.data import DataLoader, Dataset, random_split
# 数据集类
class SymptomDrugDataset(Dataset):
    def __init__(self, data, max_length):
        self.data = data
        self.max_length = max_length

    def __len__(self):
        return len(self.data)

    def __getitem__(self, idx):
        text, labels, treatment = self.data[idx]
        return text, labels, treatment
    
def set_seed(seed):
    random.seed(seed)
    np.random.seed(seed)
    torch.manual_seed(seed)
seed = 42
set_seed(seed)

# 数据预处理
def prepare_data(data, batch_size, train_ratio=0.8):
    dataset = SymptomDrugDataset(data, max_length=64)
    train_size = int(len(dataset) * train_ratio)
    test_size = len(dataset) - train_size
    train_dataset, test_dataset = random_split(dataset, [train_size, test_size])
    return train_dataset, test_dataset

data, herb_num, co_adj, name_list = read_rsj_classifier_data2()
train_dataset, test_dataset = prepare_data(data, batch_size=32)
print(len(train_dataset), len(test_dataset))

train_datalist = []
test_datalist = []

for train_data in train_dataset:
    query = f"""任务：根据[患者症状]信息,在[草药]中为患者推荐需要使用的[推荐草药]。
# 要求1: 草药局限在下方列表中。
[草药]: "准小麦", "紫苏叶", "公英", "天麻", "晚蚕砂", "北豆根", "冬瓜仁", "穿山甲", "土鳖虫", "醋炒柴胡", "肉桂心", "香附", "炒二芽", "生姜", "芍药", "元寸冬", "皂刺", "竹沥汁", "山栀", "冬桑叶", "败酱草", "新会皮", "桑椹子", "罂栗壳", "海藻", "茅根", " 朱砂", "银柴胡", "焦山栀", "生军", "芡实", "胆星", "炙远志", "六神曲", "栀仁", "当归", "草果仁", "毛冬青", "三七粉", "姜制半夏", "炙僵蚕", "何首乌", "瓜蒌皮", "艾绒炭", "青礞石", "千里光", "三七末", "冬瓜皮", "前仁", "熟附块", "附子", "王不留行", "生龙牡", "炮干姜", "薏以仁", "鸡血藤", "白芷", "净麻黄", "甘杞子", "炒桔梗", "焦白术", "枇杷根", "续断", "薄荷", "玉竹", "生薏苡仁", "生麻黄", "焦神曲", "辛夷", "蛇莓", "熟女贞子", "连翘", "降香", "常山", "五味子", "香附炭", "草河车", "山药", "炙紫菀", "玄参", "鬼箭羽", "豆豉", "紫花地丁", "制半夏", "大蓟", "荷叶梗", "炒扁豆仁", "炮姜", "白鸡冠花", "仙茅", "广木香", "黄药子", "益智仁", "葛根", "炙甘草", "乌药", "滑石块", "壁虎", "升麻", "竹茹", "胡黄连", "炮姜炭", "香附米", "玄明粉", "黄芪皮", "炮附子", "藏青果", "山豆根", "羌活", "龙骨", "金荞麦根", "大力", "南沙参", "牡丹皮", "牛黄", "生枇杷叶", " 枸杞子", "藿香", "北五味子", "川萆薢", "煅牡蛎", "蛇蜕", "煅石决明", "清炙草", "大生地", "陈棕榈炭", "白通草", "生枳壳", "苏子", "半夏", "杜红花", "莱菔子", "海带", "辰砂", "细川连", "炒谷芽", "楮实子", "五加皮", "生粉甘草", "川柏", "礞石", "大豆卷", "杜仲炭", "猫人参", "地黄炭", "白芨", "白薇", "防风", "生熟地", "炒远志", "夜交藤", "磁朱丸", "香橼皮", "赤芍药", "生大黄", "木贼", "炒莱菔子", "穿山龙", "羚羊角粉", "阿胶珠", "朱砂", "竹沥", "石决明", "炒麦冬", "淡干姜", "月季花", "制陈皮", "川椒", "桃仁泥", "赤白芍", "没药", "火麻仁", "补骨脂", "阿胶", "昆布", "生桑皮", "苦参", "人工牛黄散", "荆芥", "炙黑甘草", "香藁本", "土牛膝根", "鲜茅根", "三七参", "草果", "鸡冠花", "太子参", "银花", "胆草", "焦三仙", "焦山楂", "荷梗", "沙苑子", "南星", "吴荣萸", "京丹参", "棕榈炭", "双花", "紫河车", "木蛾", "佩兰", "制附子", "牛蒡", "至宝丹", "陈葫芦", "钧藤", "谷芽", "桔叶", "茜草", "川芎", "法半夏", "田基黄", "生黄柏", "茯神", "炒紫苏子", "陈胆南星", "人工牛黄", "大黄粉", "干地龙", "茯苓皮", "炒香附", "生地", "皂角刺", "炒酸枣仁", "酒炒当归", "生龟板", "带皮茯苓", "肉丛蓉", "桂心", "巴戟天", "薏苡", "酒军", "地骨皮", "结茯苓", "香佩兰", "十大功劳叶", "石斛", "骨碎补", "苏叶", "巨胜子", "活水芦根", "菊花", "蛤蚧", "桑螵蛸", "炒蒲黄", "辛夷花", "川石斛", "羚羊骨", "陈红", "芥穗", "高良姜", "牛膝", "法夏", "秦艽", "北五味", "胖大海", "白胡椒", "炒鸡内金", "土杭芍", "杏仁泥", "白石英", "莲子", "木瓜", "知柏地黄丸", "凌霄花", "鲜白茅根", "炙枇杷叶", "归身", "制南星", "车前仁", "鱼腥草", "生甘草节", "杭菊", "旱莲草", "金银花", "侧柏叶", "炒山楂", "蝉衣", "蒲公英", "桔梗", "六神丸", "丝瓜络", "黑附片", "淡猪苓", "丹皮", "炒苏子", "大黄炭", "湘曲", "炙龟板", "制僵蚕", "炒百芍", "麦门冬", "土茯苓", "天南星", "茜草根", "附片", "金橘叶", "鹿角胶", "泽兰", "韭菜子", "桃仁", "葫芦巴", "白蔻仁", "仙鹤草", "姜竹茹", "北柴胡", "当归身", "青蒿", "炒黄连", "生川军", "生薏米", "石楠叶", "川贝粉", "白及", "紫雪丹", "川楝", "炒三棱", "炙甲片", "狗脊", "焦杜仲", "酸枣", "淮山", "芒硝", "生地黄", "橘红", "金樱子", "小茴香", "白前", "生地榆", "虎杖", "茯苓", "炒山栀", "白生术", "黑豆", " 龟板", "炙升麻", "青葙子", "当归炭", "制乌头", "巴戟肉", "生首乌", "蝎尾", " 大黄", "炒枳壳", "款冬花", "广皮", "净连翘", "猪肝粉", "潞党参", "雄黄", "忍冬藤", "旋覆花", "青黛", "山慈菇", "蒲黄", "莪术", "南苏子", "生香附", "白茅根", "柏子仁", "升麻炭", "盐杜仲", "茺蔚子", "元胡", "紫菀", "蜈蚣", "酒当归", "藕节炭", "雷公藤", "龟胶", "熟军", "威灵仙", "加味保和丸", "桑葚", "煅龙牡", "檀香", "紫丹参", "槐米", "全蝎", "磁石", "豆卷", "蔻仁", "左牡蛎", "醋延胡索", "羚羊角", "漂白术", "青皮", "薤白", "蚯蚓", "蒲黄炭", " 胆南星", "姜半夏", "炒白术", "乌蛇", "饴糖", "大蓟根", "熟附片", "藕节", "乳香", "麻黄", "野菊花", "软柴胡", "葫芦皮", "人参", "炒建曲", "滑石", "北沙参", "岗稔根", "龙胆草", "远志肉", "白僵蚕", "淡子芩", "炒小茴香", " 牡蛎", "西红花", "香附子", "珍珠母", "川牛膝", "马齿苋", "炒麦芽", "大麦冬", "防已", "艾叶炭", "龟板胶", "西党参", "麻黄根", "代赭右", "香薷", "红藤", "煮半夏", "牛蒡子", "炒槐花", "鹿角霜", "枳壳", "扁豆", "枇杷叶", "栀子", "红枣", "骨皮", "明天麻", "紫苏", "竹草", "首乌", "生侧柏", "陈皮", " 当归", "佛手", "鹿角粉", "银杏肉", "焦苡仁", "沉香曲", "清半夏", "鳖甲", "西川芎", "知丹", "蔓荆", "银杏叶", "金银花藤", "黄松节", "西瓜翠衣", "鲜生地", "桔核", "大枣", "瓜蒌", "炒扁豆", "槐角", "京元参", "黑附子", "百合", "川木瓜", "砂仁", "代赭石", "麦冬", "泽泻", "生鳖甲", "大菖蒲", "萹蓄", "炙龟甲", "鲜竹茹", "冬瓜子", "大白", "刘寄奴", "苍耳", "全瓜蒌", "凤凰衣", "寸冬", "白蔹", "吴萸", "留行子", "淫羊藿", "炙白前", "肉桂", "山茱萸", "连翘心", "广陈皮", "生晒参", "蜀椒", "血余炭", "刀豆子", "鸡内金", "甘草梢", "僵蚕", "草决明", " 全蝎粉", "杏仁", "炒丹皮", "苡仁", "首乌藤", "桑椹", "广地龙", "云苓", "焦术", "刺蒺藜", "香谷芽", "大熟地", "山栀子", "人参叶", "蚤休", "生栀仁", "玳瑁", "乌贼骨", "鲜石斛", "石菖蒲", "杭芍", "炒金银花", "金钱草", "黑料豆", "党参", "生黄芪", "红花", "炒荆芥", "红参", "生赭石", "牡蛎", "地榆炭", "川朴", "元参", "吴芋", "川军", "白鲜皮", "炒地榆", "川连", "泽漆", "鹿衔草", "生蒲黄", "制川乌", "白茯苓", "净秫米", "九香虫", "青果", "象贝母", "川贝", "浑泻", "生苡仁", "花槟榔", "炒山药", "白头翁", "茵陈", "怀山药", "陈胆星", "生白术", "露蜂房", "巴戟", "水牛角", "白术", "肥知母", "秦皮", "淮枣仁", "沉香", "荆芥炭", "白豆", "白菊花", "小麦", "水蛭", "桂圆", "玄胡", "石韦", "三棱", "生石决明", "老鹳草", "制首乌", "川木通", "白藓皮", "琥珀", "天冬", "炒杜仲", "南丹皮", "枣仁", "乌拉草", "地龙", "生海浮石", "焦四仙", "白矾", "橘叶核", "炒枣仁", "嫩钩藤", "石蒲", "西洋参", "制大黄", "冬虫夏草", "淮小麦", "藏红花", "桑枝", "炮吴萸", "竹沥半夏", "车前草", "淡吴萸", "甘草", "枣皮", "煨草果仁", "女真子", "苏合香", "罌栗壳", "锁阳", "鲜石菖蒲", "苍耳子", "白芍", "炒牡丹皮", "当归尾", "煨木香", "黑栀子", "白附子", "山栀仁", " 山萸肉", "石榴皮", "诃子皮", "荷叶顶", "土元", "番泻叶", "白桔梗", "天竺黄", "海金沙", "炙苏子", "边条参", "大丹参", "莲肉", "龟鹿二仙胶", "杜仲", "鲜荷叶", "全当归", "苏梗", "川郁金", "紫苏梗", "炮山甲", "蜜炙白术", "粉甘草", "萸肉", "阳起石", "毛柴胡", "海螵蛸", "黑芝麻", "大力子", "东白薇", "浙贝母", "枯梗", "黄芪", "白扁豆", "地肤子", "乌梅", "炒生地黄", "地鳖虫", "小苗香", "醋柴胡", "白果", "板蓝根", "麦芽", "天龙", "川贝母", "糯稻根", "蛇床子", "制苍术", "淡附子", "川桂枝", "防己", "炒青蒿", "川厚朴", "金狗脊", "菖蒲", "杭白菊", "百部", "川断", "沙参", "炒内金", "老广皮", "槐花", "橘核", "芦根", "干姜", "炙麻黄", "车前子", "金铃子", "地丁", "钩藤", "生麦芽", "夏枯草", "猪苓", "台乌药", "小蓟", "海蛤壳", "黑山栀", "生山栀", "酸枣仁", "草豆蔻仁", "紫草", "犀角", "制香附", " 鳖甲", "生姜皮", "炒陈皮", "条芩", "熟大黄", "射干", "炒苍术", "马尾连", "公丁香", "木蝴蝶", "玉枢丹", "墨旱莲", "厚朴", "山萸肉", "木通", "人中黄", "木槿花", "诃子肉", "炮穿山甲", "田七粉", "蝉蜕", "青升麻", "花粉", "槟榔", " 天麻", "大贝母", "苍术", "竹叶", "龟板", "前胡", "五灵脂", "炙百部", "生代赭石", "焦六曲", "草豆蔻", "茜草炭", "黄芩", "肉桂粉", "天仙藤", "桑叶", "神曲", "地榆", "赤苓", "重楼", "花椒", "土炒当归", "白花蛇舌草", "化橘红", "蝎蜈片", "光杏仁", "豆根", "灯心草", "桂元肉", "浙贝", "石膏", "半枝莲", "酒黄芩", "椿根皮", "焦栀子", "拳参", "熟地黄", "陈青蒿", "珍珠粉", "紫珠草", "大腹皮", "麻子仁", "肉苁蓉", "艾叶", "生瓦楞子", "生狗脊", "煅龙骨", "洋泻", "泽兰叶", "炒莪术", "知母", "玫瑰花", "生石膏", "炙鳖甲", "芡实米", "黛蛤散", "生谷", "归尾", "儿茶", "黄苓", "竹叶心", "白豆蔻仁", "熟附子", "麝香", "血竭", "川续断", "五味", "丁香", "川槿皮", "苦杏仁", "诃子", "山楂", "芜荑", "生白芍", "生牡蛎", "云苓皮", "沙苑蒺藜", "葱白", "益母草", "川干姜", "龙齿", "白芨根", "煅瓦楞子", "川独活", "青陈皮", "肉豆蔻", "莲子肉", "桂圆肉", "虻虫", "冰片", "杭白芍", "薤白头", "路路通", "伸筋草", "田三七", "虫笋", "木香", "土炒白术", "桑白皮", "草决明子", "淡豆豉", "枸杞子", "薏米", "秦白皮", "柴胡", "枳实", "炒黄柏", "大青叶", "梨皮", "炒黄芩", "炒白芍", "豨签草", "鹤虱", "侧柏炭", "地稔根", "荔枝核", "生芡实", "炒厚朴", "郁李仁", "大黄", "槟榔片", "川黄连", "天花粉", "黄精", "乌梢蛇", "蒺藜", "赤芍", "田七参", "三七", "酒地龙", "苑丝子", "贝母", "五倍子", "赤石脂", "全虫", " 远志", "胆南星", "白芷炭", "紫川朴", "延胡索", "生龙齿", "白豆蔻", "蔓荆子", "炒砂仁", "赭石", "八月札", "苦参片", "北细辛", "细辛", "生黑豆", "白芥子", "薏苡仁", "苦桔梗", "绿萼梅", "菟丝子", "橘络", "半夏曲", "炙款冬花", "龙眼肉", "远志", "通草", "金沸草", "嫩射干", "赤茯苓", "香茶菜", "合欢皮", "炒粉葛", "炙黄芪", "漏芦", "炒川楝子", "黄柏", "仙灵脾", "吉林参须", "海浮石", "生铁落", "水红花子", "炒桃仁", "萆薢", "熟枣仁", "炒米壳", "生白果", "北芪", "葶苈子", "炙穿山甲", "徐长卿", "白蔻皮", "荷叶", "小桂枝", "桂枝", "郁金", "秦当归", "浮小麦", "挂金灯", "丹参", "淮山药", "失笑散", "炙细辛", "广郁金", "制乳没", "桑皮", "官桂", "赤小豆", "金荞麦", "鹿角片", "莲子心", "炒川黄连", "生龙骨", "制附片", "生山药", "吴茱萸", "姜黄", "大白芍", "女贞子", "黑荆芥", "蜜蒙花", "白芨粉", "苏木", "炒杏仁", "甘草节", "炙附子", "炒常山", "决明子", "自然铜", "覆盆子", "腹毛", "栝蒌皮", "台参", "桑寄生", "络石藤", "炒栀子", "李根白皮", "南胆星", "粳米", "川朴花", "焦枳实", "半边莲", "肉桂片", "山萸", "文术", "谷精草", "甘松", "二至丸", "川乌", "瓦楞子", "蚕沙", "车前", "破故纸", "马勃", "白蔻", "贯众", "䗪虫", "云茯苓", "炒薏苡仁", "姜炭", "土贝母", "生甘草", "北干姜", "炙桑白皮", "杞果", "汉防己", "木花", "灶心土", "薏仁", "青风藤", "炒生地", "怀牛膝", "川楝子", "莲须", "生山楂", "净蝉蜕", "淡竹叶", "干菖蒲", "薏米仁", "酒大黄", "花蕊石", "熟地", "炒枳实", "枯黄芩", "藁本", "合欢花", "瓜蒌仁", " 半夏", "煅鳖甲", "苦丁茶", "黄连", "焦麦芽", "六一散", "炒知母", "玉米须", "藤梨根", "天葵草", "瞿麦", "青木香", "葛花", "明矾", "枸杞", "炒竹茹", "粉丹皮", "炒延胡索", "苇茎", "鲜芦根", "独活", "柿蒂", "黑大豆", "麻仁", "蜜炙麻黄", "生栀子", "野党参", "紫石英", "白蒺藜", "浮萍", "禹余粮", "椒目", "小青皮", "香橼", "炙杷叶", "吉林人参", "生槐花"
# 要求2: 有多个中草药，每个中草药之间用逗号分隔。
# 要求3: 没有的中草药不要多写。
# 要求4: 输出中仅需要输出草药名称，不需要给出任何解释和其他信息，数量控制在10-15个左右。
[患者症状]:{train_data[0]}
[推荐草药]:
"""
    durg_list = [name_list[i] for i in train_data[1]]
    drug_str = ",".join(durg_list)
    response = f"{drug_str}"
    item = {"query": query, "response": response}
    train_datalist.append(item)

for test_data in test_dataset:
    query = f"""患者症状:{test_data[0]}
患者药物推荐:
"""
    durg_list = [name_list[i] for i in test_data[1]]
    drug_str = ",".join(durg_list)
    response = f"{drug_str}"
    item = {"query": query, "response": response}
    test_datalist.append(item)
train_file = 'qwen2.5-7b-instruct/llm_train.jsonl'
test_file = 'qwen2.5-7b-instruct/llm_test.jsonl'
with open(train_file, 'w') as f:
    for data in train_datalist:
        json.dump(data, f, ensure_ascii=False)
        f.write('\n')
with open(test_file, 'w') as f:
    for data in test_datalist:
        json.dump(data, f, ensure_ascii=False)
        f.write('\n')
print(f"Train data saved to {train_file}")
print(f"Test data saved to {test_file}")